**Merging and jOining**

#### Import the libraries

In [1]:
import pandas as pd
import numpy as np

In [2]:
student_data1 = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5'],
         'name': ['Danniella Fenton', 'Ryder Storey', 'Bryce Jensen', 'Ed Bernal', 'Kwame Morin'], 
        'marks': [200, 210, 190, 222, 199]})

student_data2 = pd.DataFrame({
        'student_id': ['S4', 'S5', 'S6', 'S7', 'S8'],
        'name': ['Scarlette Fisher', 'Carla Williamson', 'Dante Morse', 'Kaiser William', 'Madeeha Preston'], 
        'marks': [201, 200, 198, 219, 201]})

exam_data = pd.DataFrame({
        'student_id': ['S1', 'S2', 'S3', 'S4', 'S5', 'S7', 'S8', 'S9', 'S10', 'S11', 'S12', 'S13'],
        'exam_id': [23, 45, 12, 67, 21, 55, 33, 14, 56, 83, 88, 12]})

1. Create the below data frame and name it Student_data1

In [4]:
Student_data1=pd.DataFrame(student_data1)
Student_data1

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199

2. Create the below data frame and name it Student_data2

In [5]:
Student_data2=pd.DataFrame(student_data2)
Student_data2

  student_id              name  marks
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

3. Create the data frame Exam-data

In [6]:
Exam_data=pd.DataFrame(exam_data)
Exam_data

   student_id  exam_id
0          S1       23
1          S2       45
2          S3       12
3          S4       67
4          S5       21
5          S7       55
6          S8       33
7          S9       14
8         S10       56
9         S11       83
10        S12       88
11        S13       12

01. Write a Pandas program to join the two given dataframes along rows

In [7]:
sd=pd.concat([Student_data1,Student_data2])
sd

  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

Join first two said dataframes along rows:
  student_id              name  marks
0         S1  Danniella Fenton    200
1         S2      Ryder Storey    210
2         S3      Bryce Jensen    190
3         S4         Ed Bernal    222
4         S5       Kwame Morin    199
0         S4  Scarlette Fisher    201
1         S5  Carla Williamson    200
2         S6       Dante Morse    198
3         S7    Kaiser William    219
4         S8   Madeeha Preston    201

2. Merge the concatenated data frame with exam_data based on student_id

In [8]:
pd.merge(sd,Exam_data,how='inner',on='student_id')

  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

Now join the said result_data and df_exam_data along student_id:
  student_id              name  marks  exam_id
0         S1  Danniella Fenton    200       23
1         S2      Ryder Storey    210       45
2         S3      Bryce Jensen    190       12
3         S4         Ed Bernal    222       67
4         S4  Scarlette Fisher    201       67
5         S5       Kwame Morin    199       21
6         S5  Carla Williamson    200       21
7         S7    Kaiser William    219       55
8         S8   Madeeha Preston    201       33

3.  Join the two student_data 1 and student_data 2 using the common column

Merged data (inner join):
  student_id       name_x  marks_x            name_y  marks_y
0         S4    Ed Bernal      222  Scarlette Fisher      201
1         S5  Kwame Morin      199  Carla Williamson      200

### 2ND DATASET

4.Create the below data frame and name it data1

In [9]:

data1={'key1':['K0','K0','K1','K2'],
      'key2':['K0','K1','K0','K1'],
      'P':['P0','P1','P2','P3'],
      'Q':['Q0','Q1','Q2','Q3']}

df1=pd.DataFrame(data1)
df1

  key1 key2   P   Q
0   K0   K0  P0  Q0
1   K0   K1  P1  Q1
2   K1   K0  P2  Q2
3   K2   K1  P3  Q3

5.Create the below data frame and name it data1

6. Join two dataframes using keys from data 2

In [11]:
data2={'key1':['K0','K1','K1','K2'],
      'key2':['K0','K0','K0','K0'],
      'P':['P0','P2','P2',np.nan],
      'Q':['Q0','Q2','Q2',np.nan],
      'R':['R0','R1','R2','R3'],
      'S':['S0','S1','S2','S3']}
df2=pd.DataFrame(data2)
df2

  key1 key2    P    Q   R   S
0   K0   K0   P0   Q0  R0  S0
1   K1   K0   P2   Q2  R1  S1
2   K1   K0   P2   Q2  R2  S2
3   K2   K0  NaN  NaN  R3  S3

Merged Data (keys from data2):
  key1 key2    P    Q   R   S
0   K0   K0   P0   Q0  R0  S0
1   K1   K0   P2   Q2  R1  S1
2   K1   K0   P2   Q2  R2  S2
3   K2   K0  NaN  NaN  R3  S3

6. Join two dataframes using keys data 1

In [15]:
pd.merge(df1,df2,how='right',on=['key1','key2'])

  key1 key2  P_x  Q_x  P_y  Q_y   R   S
0   K0   K0   P0   Q0   P0   Q0  R0  S0
1   K1   K0   P2   Q2   P2   Q2  R1  S1
2   K1   K0   P2   Q2   P2   Q2  R2  S2
3   K2   K0  NaN  NaN  NaN  NaN  R3  S3

In [17]:
pd.merge(df1, df2[['key1', 'key2', 'R', 'S']], on=['key1', 'key2'], how='left')

  key1 key2   P   Q    R    S
0   K0   K0  P0  Q0   R0   S0
1   K0   K1  P1  Q1  NaN  NaN
2   K1   K0  P2  Q2   R1   S1
3   K1   K0  P2  Q2   R2   S2
4   K2   K1  P3  Q3  NaN  NaN

Merged Data (keys from data1):
  key1 key2    R    S   P   Q
0   K0   K0   R0   S0  P0  Q0
1   K1   K0   R1   S1  P2  Q2
2   K1   K0   R2   S2  P2  Q2
3   K0   K1  NaN  NaN  P1  Q1
4   K2   K1  NaN  NaN  P3  Q3

7. Merge two given datasets using multiple join keys.

In [18]:
m_df = pd.merge(df1, df2, on=['key1', 'key2'], how='inner')
m_df

  key1 key2 P_x Q_x P_y Q_y   R   S
0   K0   K0  P0  Q0  P0  Q0  R0  S0
1   K1   K0  P2  Q2  P2  Q2  R1  S1
2   K1   K0  P2  Q2  P2  Q2  R2  S2

In [23]:
m_df = pd.merge(df1, df2, on=['key1', 'key2'], how='inner')
m_df = m_df[['key1', 'key2', 'P_x', 'Q_x', 'R', 'S']]
m_df.columns = ['key1', 'key2', 'P', 'Q', 'R', 'S']
m_df

  key1 key2   P   Q   R   S
0   K0   K0  P0  Q0  R0  S0
1   K1   K0  P2  Q2  R1  S1
2   K1   K0  P2  Q2  R2  S2

### 3RD QUESTION

Find the below data set and solve the questions

In [24]:
data={'A':['A0','A1','A2'],
      'B':['B0','B1','B2']}
df1=pd.DataFrame(data,index=['K0','K1','K2'])
df1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [27]:
data2={'C':['C0','C2','C3'],
      'D':['D0','D2','D3']}
df2=pd.DataFrame(data2,index=['K0','K2','K3'])
df2

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

8. Combine the columns of two potentially differently-indexed DataFrames into a single result DataFrame.

In [29]:
df1.join(df2)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2